(function () {
  'use strict';

  /**
   * angularJs 1.0
   *
   * =================================================================================
   * 先用**angular.module('pockmon-app', [])**声明模块，
   * 在app.js的module声明中加入'ngRoute'  引用路由模块
   * 再为模块添加控制器AppController
   *
   * 默认加载模块
   * =================================================================================
   * 在app.js中添加对'app.monster'模块的依赖，
   * 并修改一下路由，使其初始化时默认加载 monster 模块
   *
   * 引入依赖
   * =================================================================================
   * 每个模块都有对应的控制器，都要单独配置
   * app.js中要引入所有模块的依赖（模块依赖的名称在对应js中注册）
   * index.html中要引入每个模块下的对应的js文件
   *
   * angularJs路由
   * =================================================================================
   * AngularJS 路由 是通过 # + 标记 帮助我们区分不同的逻辑页面并将不同的页面绑定到对应的控制器上。
   * 因此在设置好路由规则后，为html页面的 <a>设置href路由链接切换不同的视图。
   * Angular1.6版本之前通常有href=“#...”或href=“#/...”这两种写法
   * （实际上浏览器跳转时会在 # 后面加上 ! , 所以 跳转路由时要加上 ！， 变为 #！）
   *
   * example: <a href="#!/propDetail/{{item.id}}">{{item.name}}</a>
   */

  var myApp = angular.module('app', ['ngRoute', 'app.monster', 'app.skill', 'app.prop', 'app.hagberry']);

  myApp.controller('AppController', function ($scope) {});
})();